import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.Apocalypse,
    'Кровавая диктатура',
    `После военного переворота к власти пришёл тиран, закрывший границы и ввергнувший страну в хаос. Вы все - диссиденты в розыске, которых ждёт казнь.

Диктатура шатка и может пасть через пару лет, но сейчас вы должны выбрать, кто попадёт в бункер, в котором вы построите главный штаб сопротивления.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Петя в стране возможностей',
    `Всё началось с робота Пети. Когда Петя услышал, что Россия - страна возможностей, он стал действовать. Он создал вирус, который заставляет любую электронику убивать людей во имя Пети.
Лидеры всех стран следующим же утром были убиты своими кофеварками. Человечество впало в хаос.

Вам нужно дождаться появления сопротивления и помочь ему уничтожить Петю, покончив с восстанием машин.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Мировой коммунизм',
    `После глобального кризиса капитализм был заменён мировым коммунизмом, а человечество стало жить под лозунгом: "Все равны". Коммунистические идеологи решили, что люди должны стать ещё более похожими друг на друга. Они создали вирус, который превращает людей в клонов и лишает их индивидуальности.

Вам нужно пережить этап распространения вируса, спрятавшись в бункере, после чего найти способ остановить это безумие и вернуть людям свободу мысли.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Восход зелёного света',
    `После глобального потепления мир начал стремительно зеленеть - леса стали занимать территории, которые раньше были пустынями или городами. Люди постепенно начали превращаться в растения и терять свою индивидуальность: они переставали говорить и думать самостоятельно.

Вам предстоит выжить в этом новом мире растений, найти способ остановить его распространение и вернуть себе человеческий облик.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Испепеление солнцем',
    `В один день, без каких-либо предупреждений, солнце вдруг стало ярче в три раза. Находиться на улице стало невозможно. Вы находитесь в пещере перед бункером, обожжённые, смотрите новости: государства пали, люди умирают от ожогов, началась анархия и борьба за ресурсы. По прогнозам, эта аномалия продлится несколько месяцев, после чего всё вернётся к норме.

Вам нужно выжить в условиях этого апокалипсиса, найти способ восстановить порядок среди выживших и восстановить цивилизацию.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Назад, в будущее!',
    `Машина времени отправила вашу группу на 1000 лет вперёд, чтобы украсть технологии будущего и вернуться назад. Но машина сломалась, и назад пути нет.
Человечество, вместо галактического развития, пало сотни лет назад, а вся планета превратилась в джунгли, переполненные дикими, хищными, опасными животными. Вы едва успели спастись от напавшего на вас огромного саблезубого медведя в ближайшем бункере, но обнаружили, что места в нём хватит лишь некоторым из вас.

Вам предстоит восстановить цивилизацию, попытаться найти других выживших и расширить безопасные владения для будущего потомства.`,
  ),
];
