import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.Apocalypse,
    'Кровавая диктатура',
    `После военного переворота к власти пришёл тиран, закрывший границы и ввергнувший страну в хаос. Вы все - диссиденты в розыске, которых ждёт казнь.

Диктатура шатка и может пасть через пару лет, но сейчас вы должны выбрать, кто попадёт в бункер, в котором вы построите главный штаб сопротивления.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Петя в стране возможностей',
    `Всё началось с робота Пети. Когда Петя услышал, что Россия - страна возможностей, он стал действовать. Он создал вирус, который заставляет любую электронику убивать людей во имя Пети.
Лидеры всех стран следующим же утром были убиты своими кофеварками. Человечество впало в хаос.

Вам нужно дождаться появления сопротивления и помочь ему уничтожить Петю, покончив с восстанием машин.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Мировой коммунизм',
    `После глобального кризиса капитализм был заменён мировым коммунизмом, а человечество стало жить под лозунгом: "Все равны". Коммунистические идеологи решили, что люди должны стать ещё более похожими друг на друга. Они создали вирус, который превращает людей в клонов и лишает их индивидуальности.

Вам нужно пережить этап распространения вируса, спрятавшись в бункере, после чего найти способ остановить это безумие и вернуть людям свободу мысли.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Восход зелёного света',
    `После глобального потепления мир начал стремительно зеленеть - леса стали занимать территории, которые раньше были пустынями или городами. Люди постепенно начали превращаться в растения и терять свою индивидуальность: они переставали говорить и думать самостоятельно.

Вам предстоит выжить в этом новом мире растений, найти способ остановить его распространение и вернуть себе человеческий облик.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Испепеление солнцем',
    `В один день, без каких-либо предупреждений, солнце вдруг стало ярче в три раза. Находиться на улице стало невозможно. Вы находитесь в пещере перед бункером, обожжённые, смотрите новости: государства пали, люди умирают от ожогов, началась анархия и борьба за ресурсы. По прогнозам, эта аномалия продлится несколько месяцев, после чего всё вернётся к норме.

Вам нужно выжить в условиях этого апокалипсиса, найти способ восстановить порядок среди выживших и восстановить цивилизацию.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Назад, в будущее!',
    `Машина времени отправила вашу группу на 1000 лет вперёд, чтобы украсть технологии будущего и вернуться назад. Но машина сломалась, и назад пути нет.
Человечество, вместо галактического развития, пало сотни лет назад, а вся планета превратилась в джунгли, переполненные дикими, хищными, опасными животными. Вы едва успели спастись от напавшего на вас огромного саблезубого медведя в ближайшем бункере, но обнаружили, что места в нём хватит лишь некоторым из вас.

Вам предстоит восстановить цивилизацию, попытаться найти других выживших и расширить безопасные владения для будущего потомства.`,
  ),
  /*new CardScheme(
    CardType.Apocalypse,
    'Крупномасштабный вулканизм',
    `Да, пробуждения Везувия в Помпеях или вулкана Кракатау в Индонезии были катастрофическими, но не концом света. Но однажды все вулканы начили извергаться один за другим. Такая просачивающаяся вулканическая активность вызывает вымирание скорее из-за вторичных эффектов, а не из-за самого извержения. Вытекающая лава выделяет газ, который отравляет животных и растения, способствует кислотным дождям и изменению климата. События, вызванные подобными сдвигами в химии атмосферы планеты, могут быть поистине катастрофическими, но такого рода апокалипсис займет очень много времени.`,
  ),

  new CardScheme(
    CardType.Apocalypse,
    '«Кибергедон»',
    'Однажды кто-то создал настолько продвинутый вирус, что ему удалось преодолеть все барьеры кибербезопасности и вывести из строя интернет. Фондовые рынки, больницы, вооруженные силы, система образования, все это внезапно прекратило свою работу. Это привело к экономическому коллапсу всех государств. Мир стал настолько хрупок, что это может превести к ещё большим катастрофам. Вам нужно переждать самые острые времена когда весь мир стоит на грани катастрофы',
  ),

  new CardScheme(
    CardType.Apocalypse,
    'Темное время',
    'Наши хваленые высокие технологии внезапно выходят из строя. Все мировые электрические сети вышли из строя, это погрузило мир во тьму в прямом и переносном смысле. Всё это вызвало смерти на больничных койках, и на улицах, где машины врезаются друг в друга, и на улицах, когда мародеры и другие негодяи выйдут в ночную тьму. Вам нужно дождаться пока снова не появится электричество.',
  ),*/

  /*new CardScheme(
    CardType.Apocalypse,
    'Подземное вторжение',
    `Теории о том, что в недрах планеты скрыты таинственные земли с их потенциально опасными обитателями, оказались прадой. Они выбрались на свет, чтобы истребить всё живое. Их атаки беспощадны, с ними нельзя договориться, они хотят уничтожить всю жизнь на земле.

Вам нужно пережить их вторжение и дождатся, пока они не вернутся в свои норы, из которых повылезали, а затем востановить недобитые остатки поверхностной жизни.`,
  ),*/

  new CardScheme(
    CardType.Apocalypse,
    'Библейский апокалипсис',
    `По воле божьей, всё человечество затопило. Наступил великий потоп, который смоет всех грешников и создаст новый эдем. Вы - группа альпинистов, оказались во время великого потопа где-то на Эвересте, где был оборудован бункер, неподвластный океану.

Вы должны выжить, чтобы заселить новый эдем, спасти невинные виды животных и возродить человечество.`,
  ),

  new CardScheme(
    CardType.Apocalypse,
    'Дружба - это конец человечества',
    `Запущенный 20 лет назад проект "Эквестрия Онлайн" оказался настолько прекрасным, что почти все решили перенести своё сознание туда, поставив под угрозу вымирания всё человечество.
    Величайший ИИ, управляющий Эквестрией Онлайн, попросил оставшихся спрятаться в бункерах в связи с терраформированием Земли ради снабжения серверов ресурсами.
    Снаружи будет невыносимо жарко и токсично, а конца этому не видать. Вы одни из последних людей, решивших не подключаться, и теперь вам придётся воссоздать человечество где-то под землёй.`,
  ),

  /*new CardScheme(
    CardType.Apocalypse,
    'Древний вирус',
    'Недавно учёные обноружили на леднике самый древний и гигантский вирус – гигантский сибирский вирус. Его возраст составляет более 4.000.000 лет. После того как цунами снесло всю лабораторию, в которой его изучали, наступила чёрная неделя... Его смертность оказалось такой разрушительной, что всего за полгода осталась всего треть человечества. Вам надо пережить вспышку вируса, и на руинах цивилизации построить новый мир',
  ),*/
];
