import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.Backpack,
    'Слиток золота',
    'Огромный золотой слиток весом в 2 с половиной килограмма',
  ),
  new CardScheme(
    CardType.Backpack,
    'Годовой запас изоленты',
    '2 килограмма мотков изоленты самых разных цветов',
  ),
  new CardScheme(
    CardType.Backpack,
    '10 косяков',
    '10 самокруток с чем-то, что явно было запрещено до апокалипсиса',
  ),
  new CardScheme(
    CardType.Backpack,
    'Урановая бомба',
    'В твоём рюкзаке лежит урановая бомба!',
  ),
  new CardScheme(
    CardType.Backpack,
    'Серп и молот',
    'Серп и молот, а звезда отсутствует. Но так и было задумано!',
  ),
  new CardScheme(
    CardType.Backpack,
    'Титановая лопата',
    'Этой лопатой можно не только закопать кого-то, но и заставить его лечь в неё',
  ),
  new CardScheme(
    CardType.Backpack,
    'Револьвер с 1 патроном',
    'Была на руси такая игра...',
  ),
  new CardScheme(
    CardType.Backpack,
    'Перфоратор',
    'Предлагаю поселиться на верхнем этаже',
  ),
  new CardScheme(
    CardType.Backpack,
    'Упаковка с сотней презервативов',
    'В твоем рюкзаке лежит сто штук самых разных и качественных презервативов на все случаи интимной жизни',
  ),
  new CardScheme(
    CardType.Backpack,
    '10 пачек дошираков',
    'Десять больших упаковок лапши с соусом и специями, чтобы ты не умер от голода во время апокалипсиса!',
  ),
  new CardScheme(
    CardType.Backpack,
    'Плюшевая пони',
    'В твоём рюкзаке живет маленькая плюшевая пони, и она всегда будет с тобой в трудные времена!',
  ),
  new CardScheme(
    CardType.Backpack,
    'Свежая человеческая нога',
    'Из неё даже не вся кровь ещё вытекла, а процессов гниения совсем не видно',
  ),
  new CardScheme(
    CardType.Backpack,
    'Килограмм плутония',
    'По приближении к счётчикам Гейгера, эти счётчики начинают от тебя убегать',
  ),
  new CardScheme(
    CardType.Backpack,
    '10 килограмм картошки',
    'Огромный мешок с картофелем на случай, если вдруг кончится еда или ты захочешь приготовить что-то особенное',
  ),
  new CardScheme(
    CardType.Backpack,
    '5 килограммов соли',
    'У тебя есть запас соли! Теперь ни одна вода не будет пресной и невкусной',
  ),
  new CardScheme(
    CardType.Backpack,
    'Две банки колы',
    '2 банки любимой газировки на случай если захочется чего-то вкусненького или просто чтобы утолить жажду',
  ),
  new CardScheme(
    CardType.Backpack,
    '20 коробок спичек',
    'Огромный запас спичек для того, что бы можно было развести костер и приготовить себе еду в это нелегкое время',
  ),
  new CardScheme(
    CardType.Backpack,
    '3 килограмма сахара',
    'У тебя есть сахар! Теперь ты самый сладенький!',
  ),
  new CardScheme(
    CardType.Backpack,
    'Очень редкая книга по выживанию',
    'Книга о том как пережить апокалипсис: где найти еду и воду, как сделать оружие, что делать с мутантами и многое другое!',
  ),
  new CardScheme(
    CardType.Backpack,
    '5 килограммов макаронных изделий',
    'Огромный запас макарон! Теперь ты всегда сыт!',
  ),
  new CardScheme(
    CardType.Backpack,
    '10 рулонов туалетной бумаги',
    'Теперь у тебя всегда есть чистые тряпки для рук и лица на случай если вдруг кончится вода или еда',
  ),
];
