import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.Health,
    'СПИД',
    'У тебя синдром приобретённого иммунодефицита. Это не лечится.',
  ),
  new CardScheme(
    CardType.Health,
    'Шизофрения',
    'Ты слышишь голоса, которых нет, видишь то, чего нет, и в целом, прекрасно общаешься без людей.',
  ),
  new CardScheme(
    CardType.Health,
    'Биполярное расстройство',
    'Периодами по несколько месяцев ты то на нереальном подъёме, то в тяжелейшей депрессии.',
  ),
  new CardScheme(
    CardType.Health,
    'Гипергидроз',
    'У тебя повышенная потливость всего тела, даже если ты в прохладе и сухости.',
  ),
  new CardScheme(
    CardType.Health,
    'Гепатит-B',
    'Ты немного похож на Симпсона, а ещё у тебя болит правый бок.',
  ),
  new CardScheme(
    CardType.Health,
    'Киста почки',
    'Многие люди живут с кистой в почке всю жизнь и даже не знают об этом. У тебя же она выросла до размеров куриного яйца.',
  ),
  new CardScheme(
    CardType.Health,
    'Герпес',
    'У тебя между ног огромный прыщ, который будет болеть ещё несколько недель!',
  ),
  new CardScheme(
    CardType.Health,
    'Полностью здоров',
    '1-2% людей на земле абсолютно здоровы, и ты в их числе. Поздравляю!',
  ),
  new CardScheme(
    CardType.Health,
    'Рак терминальной стадии',
    'Рак терминальной стадии. Жить тебе осталось не больше месяца, тебя спасёт только чудо.',
  ),
  new CardScheme(
    CardType.Health,
    'Меганоги',
    'У тебя неадекватно большие и накаченные ноги.',
  ),
  new CardScheme(
    CardType.Health,
    'Хронический недосып',
    'Ты перепробовал всё, но так и не избавился от постоянной сонливости и кривого режима сна.',
  ),
  new CardScheme(
    CardType.Health,
    'Бесплодие',
    'У тебя никогда не будет детей.',
  ),
  new CardScheme(
    CardType.Health,
    'Астма',
    'Время от времени тебе необходимо использовать ингаллятор. А ещё ты можешь умереть от аллергии.',
  ),
  new CardScheme(
    CardType.Health,
    'Гигантизм',
    'Ты очень высокий и твой рост превышает 2 метра.',
  ),
  new CardScheme(
    CardType.Health,
    'Постоянный голод',
    'У тебя нет аппетита, ты постоянно хочешь есть - возможно у тебя болезнь Крейтцфельда-Якоба.',
  ),
  new CardScheme(
    CardType.Health,
    'Алкоголизм',
    'Ты пьёшь каждый день и не можешь остановиться.',
  ),
  new CardScheme(
    CardType.Health,
    'Амнезия',
    'У тебя полная потеря памяти - ты ничего не помнишь за последние несколько лет своей жизни.',
  ),
  new CardScheme(
    CardType.Health,
    'Ожирение третьей степени',
    'Живот у тебя размером с дом и он постоянно раздувается на ветру.',
  ),

  new CardScheme(
    CardType.Health,
    'Аденома гипофиза',
    'Доброкачественное новообразование, которое развивается из клеток передней доли в центре мозга',
  ),

  new CardScheme(
    CardType.Health,
    'Анальная трещина',
    'Медицинская проблема, которая сопровождается болевым синдромом в области анального канала',
  ),

  new CardScheme(CardType.Health, 'Близорукость', 'Хрен попадёшь по дальней цели'),

  new CardScheme(
    CardType.Health,
    'Булимия',
    'Психическое расстройство характеризующиеся эпизодами бесконтрольного потребления высококалорийной пищи',
  ),

  new CardScheme(
    CardType.Health,
    'Выпадение прямой кишки',
    'Нижняя часть ануса растягивается и начинает выпадать из заднего прохода',
  ),

  new CardScheme(
    CardType.Health,
    'Фарингит',
    'Воспаление слизистой оболочки задней стенки глотки',
  ),

  new CardScheme(
    CardType.Health,
    'Лимфома',
    'Злокачественная опухоль в лимфоидной ткани. Последний понедельник живешь',
  ),

  new CardScheme(CardType.Health, 'Геморрой', 'Аааааааа жопа горит, ааааааа'),

  new CardScheme(
    CardType.Health,
    'Менингит',
    'Воспалительный процесс в оболочках головного и спинного мозга. Без врача тебе конец',
  ),

  new CardScheme(
    CardType.Health,
    'Чесотка',
    'Ты постоянно чешешься там где не надо',
  ),

  new CardScheme(CardType.Health, 'Вшивость', 'Фу, отойди от меня'),

  new CardScheme(
    CardType.Health,
    'Импотенция',
    'Не смотря на стереотипы, совершенно не означает бесплодие',
  ),

  new CardScheme(
    CardType.Health,
    'Гонорея',
    'У тебя гноится всё, что ниже пояса',
  ),

  new CardScheme(CardType.Health, 'Недержание', 'Недержание мочи'),
];
