import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.Hobby,
    'Путешествия',
    'Ты любишь исследовать просторы вдали от дома',
  ),
  new CardScheme(
    CardType.Hobby,
    'Разделка животных',
    'Любой дохлый голубь становится твоим развлечением',
  ),
  new CardScheme(
    CardType.Hobby,
    'Шитьё',
    'Ты часто делаешь себе модификации на одежду, хвастаясь ими перед всеми',
  ),
  new CardScheme(
    CardType.Hobby,
    'Стрельба',
    'Ты любишь пострелять в какой-нибудь глуши по приколу, тренируя меткость',
  ),
  new CardScheme(
    CardType.Hobby,
    'Кемпинг',
    'Ты любишь сидеть в палатке и притворяться, что комаров не существует',
  ),
  new CardScheme(
    CardType.Hobby,
    'Графический дизайн',
    'Ты найдёшь миллион претензий к дизайну гугла и эппла, и веришь, что сможешь лучше',
  ),
  new CardScheme(
    CardType.Hobby,
    'Садоводство',
    'Ты выращиваешь овощи, но сам ты не овощ, хоть и считаешь их своими детьми',
  ),
  new CardScheme(
    CardType.Hobby,
    'Садомазо',
    'Ты видишь в боли что-то, чего не видят другие. В прочем, ты как-то регулярно находишь тех, кому это тоже нравится.',
  ),
  new CardScheme(
    CardType.Hobby,
    'Спасение животных',
    'Тебе нравится думать, что ты спасаешь беззащитных маленьких существ от смерти или голода',
  ),
  new CardScheme(
    CardType.Hobby,
    'Изучение языков',
    'Ты знаешь несколько слов на многих языках и мечтаешь выучить их все',
  ),
  new CardScheme(
    CardType.Hobby,
    'Писательство',
    'Твой разум постоянно генерирует идеи для книг и сценариев. Ты мечтаешь стать известным писателем!',
  ),
  new CardScheme(
    CardType.Hobby,
    'Изучение культуры других народов',
    'Ты любишь читать об истории разных стран или смотреть фильмы на иностранных языках. Тебе нравится узнавать больше о том мире, который тебя окружает',
  ),
  new CardScheme(
    CardType.Hobby,
    'Создание музыки',
    'Ты любишь создавать музыку и играть на музыкальных инструментах. Ты мечтаешь стать известным музыкантом!',
  ),
];
