import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.Hobby,
    'Путешествия',
    'Ты любишь исследовать просторы вдали от дома',
  ),
  new CardScheme(
    CardType.Hobby,
    'Разделка животных',
    'Любой дохлый голубь становится твоим развлечением',
  ),
  new CardScheme(
    CardType.Hobby,
    'Шитьё',
    'Ты часто делаешь себе модификации на одежду, хвастаясь ими перед всеми',
  ),
  new CardScheme(
    CardType.Hobby,
    'Стрельба',
    'Ты любишь пострелять в какой-нибудь глуши по приколу, тренируя меткость',
  ),
  new CardScheme(
    CardType.Hobby,
    'Кемпинг',
    'Ты любишь сидеть в палатке и притворяться, что комаров не существует',
  ),
  new CardScheme(
    CardType.Hobby,
    'Графический дизайн',
    'Ты найдёшь миллион претензий к дизайну гугла и эппла, и веришь, что сможешь лучше',
  ),
  new CardScheme(
    CardType.Hobby,
    'Садоводство',
    'Ты выращиваешь овощи, но сам ты не овощ, хоть и считаешь их своими детьми',
  ),
  new CardScheme(
    CardType.Hobby,
    'Садомазо',
    'Ты видишь в боли что-то, чего не видят другие. В прочем, ты как-то регулярно находишь тех, кому это тоже нравится.',
  ),
  new CardScheme(
    CardType.Hobby,
    'Спасение животных',
    'Тебе нравится думать, что ты спасаешь беззащитных маленьких существ от смерти или голода',
  ),
  new CardScheme(
    CardType.Hobby,
    'Изучение языков',
    'Ты знаешь несколько слов на многих языках и мечтаешь выучить их все',
  ),
  new CardScheme(
    CardType.Hobby,
    'Писательство',
    'Твой разум постоянно генерирует идеи для книг и сценариев. Ты мечтаешь стать известным писателем!',
  ),
  new CardScheme(
    CardType.Hobby,
    'Изучение культуры других народов',
    'Ты любишь читать об истории разных стран или смотреть фильмы на иностранных языках. Тебе нравится узнавать больше о том мире, который тебя окружает',
  ),
  new CardScheme(
    CardType.Hobby,
    'Создание музыки',
    'Ты любишь создавать музыку и играть на музыкальных инструментах. Ты мечтаешь стать известным музыкантом!',
  ),
  new CardScheme(
    CardType.Hobby,
    'Боевые искусства',
    'Ты уже долгое время огребаешь по профессиональному',
  ),

  new CardScheme(
    CardType.Hobby,
    'Серфинг',
    'Ты обладаешь довольно сильным прессом и хорошо держишь баланс',
  ),

  new CardScheme(CardType.Hobby, 'Парашютный спорт', 'ЭТО МУЖИТСКИЙ ДОЖДЬ!'),

  new CardScheme(
    CardType.Hobby,
    'Бильярд',
    'Ты профессионально забиваешь шары в лумки',
  ),

  new CardScheme(CardType.Hobby, 'Косплей', 'Завсегдатый фурри фестивалей'),

  new CardScheme(
    CardType.Hobby,
    'Пилатес',
    'Вы ежедневно выполняете серию упражнений для развития мышц всего тела, улучшения осанки и координации',
  ),

  new CardScheme(
    CardType.Hobby,
    'Шахматы',
    'Вы умеете мыслить на несколько ходов вперед и вырабатывать свои собственные стратегии',
  ),

  new CardScheme(
    CardType.Hobby,
    'Маджонг',
    'Вы умеете мыслить на несколько ходов вперед и вырабатывать свои собственные стратегии',
  ),

  new CardScheme(
    CardType.Hobby,
    'Блоггер',
    'Ты любишь записывать свою жизнь и показывать её людям, вызывая у них зависть и хейт',
  ),

  new CardScheme(CardType.Hobby, 'Разработка сайтов', 'Ты пилишь сайты'),

  new CardScheme(
    CardType.Hobby,
    'Пчеловод',
    'Ты ухаживаешь за пчелами и получашь от них мед',
  ),

  new CardScheme(
    CardType.Hobby,
    'Бонсай',
    'Ты выращиваешь деревья. Цель не просто вырастить дерево, а придать ему особенную форму',
  ),

  new CardScheme(
    CardType.Hobby,
    'Хиромантия',
    'Ты гадаешь по линиям на руках человека',
  ),

  new CardScheme(CardType.Hobby, 'Астрология', 'Ты гадаешь по звездам'),

  new CardScheme(
    CardType.Hobby,
    'Виноделие',
    'У вас растет свой виноград на даче, из него вы делаете домашнее вино',
  ),

  new CardScheme(
    CardType.Hobby,
    'Трейнспоттинг',
    'У тебя нездоровая любовь к поездам... Ты наблюдаешь за ними при любой возможности',
  ),

  new CardScheme(
    CardType.Hobby,
    'Хикару Дороданго',
    'Превращение грязи в блестящие и сферические шары',
  ),
];
