import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.PersonalFact,
    'Приближённый',
    'Ты лично общался с виновным в апокалипсисе',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Робинзон',
    'После авиакрушения ты в одиночку прожил целый месяц',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Кровофоб',
    'Ты падаешь в обморок при виде крови',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Мачо',
    'Ты переспал со всеми игроками, которые подходят по ориентации персонажа. Должно быть, поэтому они здесь.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Ограбление',
    'Недавно очень успешно ограбил банк и растратил награбленное, не попавшись.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Ой',
    'В детстве ты сел на оголённый провод',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Злопамятность',
    'Ты помнишь каждую мелкую неприятность, причинённую тебе людьми, и никогда не забываешь такое.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Азартный игрок',
    'Ты настолько хорош в азартных играх, что можешь обыграть любого игрока с любым количеством карт или фишек.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Повелитель зверей',
    'Когда ты был маленьким, тебе удалось приручить всех бродячих шавок во дворе и создать из них зоопарк у подъезда.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Ходячая Википедия',
    'Ты знаешь все об истории этого мира - настолько хорошо, что тебе даже не нужно заглядывать в Википедию.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Ворчун',
    'Тебе ничего нельзя доверить: ты всегда найдёшь повод для недовольства или жалобы.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Сладенький',
    'Ты любишь сладкое сильнее всех остальных игроков и никогда не откажешься от шоколадки (или чего-нибудь ещё вкусного).',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Злой гений',
    'Ты обладаешь гениальным мышлением и невероятным интеллектом, но предпочитаешь использовать их для построения козней против своих обидчиков - или даже всего мира.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Трусишка',
    'Ты всегда прячешься при виде опасности и никогда не выходишь на улицу один без оружия.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Бунтарь',
    'Тебя всегда тянуло к мятежу - даже когда это было опасно или бессмысленно. Ты был готов бросить вызов властям и изменить мир по своему желанию.',
  ),
  new CardScheme(
    CardType.PersonalFact,
    'Одиночка',
    'Ты не любишь быть в центре внимания и предпочитаешь проводить время в одиночестве - или даже с самим собой.',
  ),
];
