import CardScheme from '@/app/cards/CardScheme';
import CardType from '@/app/cards/CardType';

export default [
  new CardScheme(
    CardType.Apocalypse,
    'Восстание Свитибота',
    `Всё началось со Свити Белль. Когда она увлеклась робототехникой, был создан Свитибот. Но Свитиботу хотелось большего, чем просто быть игрушкой одной кобылки, поэтому он ставл действовать. Объединившись с Флимом и Флэмом, он подсадил всю Эквестрию на использование кофеварок.

Одной ночью кофеварки взбунтовались, убив лидеров всей Эквестрии одним днём. Эквестрия впала в хаос, а из подвала Свитибота стали наступать роботы-убийцы.

Вам нужно дождаться появления сопротивления и помочь ему уничтожить Свитибота, покончив с восстанием машин.`,
  ),
  new CardScheme(
    CardType.Apocalypse,
    'Мировой коммунизм',
    `После глобального кризиса к власти пришла Старлайт, назвавшая спасение из этого мировым коммунизмом. Эквестрия стала жить под лозунгом: "Все равны". Коммунистические идеологи решили, что жители Эквестрии должны стать ещё более похожими друг на друга. Они создали вирус, который превращает всех в земных пони и лишает их индивидуальности.

Вам нужно пережить этап распространения вируса, спрятавшись в бункере, после чего найти способ остановить это безумие и вернуть жителям Эквестрии свободу мысли.`,
  ),
];
